early_models/flapping_wing_2d_sbr/0_org/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    farfield
    {
        type            fixedValue;
        value           $internalField;
    }

    wing
    {
        type        solidBodyMotionDisplacement;

        solidBodyMotionFunction tabulated6DoFMotion;
        CofG         (0.0 0.25 0);
        timeDataFileName "<constant>/6DoF.dat";
    }
}

// ************************************************************************* //
